import { useState } from "react"; 
import { BrowserRouter, Routes, Route } from "react-router-dom";
import Header from "./components/Header";
import FirstSection from "./components/FirstSection";
import SecondSection from "./components/SecondSection";
import ExclusiveSection from "./components/ExclusiveІуSection";
import FoodContainer from "./components/FoodContainer";
import Register from "./pages/Register";
import "./Menu.css";


const foods = [
  {
    image: "first-food.webp",
    title: "Cуп з фрикадельками",
    price: "200 грн",
    ingredients: [
      "фарш з індички - 453,59 г",
      "сіль - 1,5 ст. л. (розділити)",
      "мелений чорний перець – 1 ч. л.",
      "яйце - 1 шт.",
      "оливкова олія - ​​2 ст. л.",
      "морква - 2 шт.",
      "цибуля - 1/2 головки",
      "картопля - 3 шт.",
      "рис - 92,5 г",
      "зелена цибуля - 2 ст. л.",
      "свіжа петрушка - 2 ст. л.",
    ],
  },
  {
    image: "first-food2.jpg",
    title: "Борщ",
    price: "100 грн",
    ingredients: [
      "Свинячі кістки з м'ясом - 500 г",
      "Квасоля - 200 г",
      "Буряк - 1 шт",
      "Картопля - 3-4 шт",
      "Капуста - 0,5 маленької головки",
      "Морква - 1 шт",
      "Цибуля - 1 шт",
      "Томатна паста - 70 г",
      "Цукор - 1 ст. л",
      "Оцет - 1 ст. л.",
      "Сіль - до смаку",
      "Лимонний сік - до смаку",
      "Перець духмяний - 3-4 горошини",
      "Лавровий лист - 2 шт",
      "Часник - 2 зубці",
      "Олія - для смаження",
      "Сметана - для подачі",
    ],
  },
  {
    image: "first-food3.jpg",
    title: "Курячий суп",
    price: "150 грн",
    ingredients: [
      "Курячих стегна - 2 шт",
      "Горошини чорного перцю - 3 шт",
      "Лавровий лист - 1 шт.",
      "Цукіні або кабачків - 200г",
      "Томатів чері - 150г",
      "Солодкий перець - 1шт",
      "Макарони (вермішель) - 1 порція",
      "Кріп - 3 гілочки",
      "Сіль і перець до смаку",
    ],
  },
  {
    image: "first-food4.webp",
    title: "Суп з пельменями",
    price: "100 грн",
    ingredients: [
      "Оливкова олія - 2 ст. л.",
      "Морква - 2 середні",
      "Цибуля - 1/2 великої",
      "Кукурудза заморожена - 1 кг",
      "Курячий бульйон - 3 л",
      "Пельмені - 450 г",
      "Зелена цибуля - 1 пучок",
      "Петрушка свіжа - 3 ст. л.",
    ],
  },
];


const extraFoods = [
  {
    image: "second-food.jpg",
    title: "Картопля по-селянськи",
    price: "100 грн",
    ingredients: [
      "Картопля середня – 6 шт.",
      "Борошно пшеничне – 50 г",
      "Борошно кукурудзяне – 50 г",
      "Сіль – 2 ч. л.",
      "Олія соняшникова – 2 ст. л.",
      "Масло вершкове – 1 ст. л.",
    ],
  },
  {
    image: "second-food2.jpg",
    title: "Спагеті з мідіями в вершковому соусі",
    price: "100 грн",
    ingredients: [
      "Спагеті – 200 г",
      "Мідії варені морожені – 200 г",
      "Цибуля – 1 шт.",
      "Оливкова олія – 20 г",
      "Вершки – 100-150 г",
      "Італійські трави – 2 ч. л.",
      "Петрушка – 2-3 гілочки",
      "Сіль – 1/2 ч. л.",
    ],
  },
  {
    image: "second-food3.jpg",
    title: "Плов з куркою",
    price: "100 грн",
    ingredients: [
      "Філе курячого стегна – 700 г",
      "Довгозернистий рис – 700 г",
      "Цибуля – 300 г",
      "Морква – 300 г",
      "Сіль – за смаком",
      "Спеції для плову – за смаком",
      "Олія – для смаження",
      "Вода – для приготування",
    ],
  },
  {
    image: "second-food4.jpg",
    title: "Пісний капусняк з квашеною капустою та пшоном",
    price: "100 грн",
    ingredients: [
      "Квашена капуста – 500 г",
      "Свіжа капуста (натерта) – 500 г",
      "Томатний сік – 200 мл",
      "Пшоно – 100 г",
      "Картопля середня – 5 шт.",
      "Морква – 1 шт.",
      "Цибуля – 1 шт.",
      "Лавровий лист – 1 шт.",
      "Олія для смаження",
      "Часник – 2 зубчики",
      "Зелень – за смаком",
      "Солодкий перець – 1 шт.",
      "Сіль – за смаком",
    ],
  },
];


const ExclusiveFoods = [
  {
    image: "exclusiveІу-food.jpg",
    title: "Хрусткі картопляні деруни",
    price: "100 грн",
    ingredients: [
      "Картопля середня – 6 шт.",
      "Цибуля – 1 шт.",
      "Яйце куряче – 1 шт.",
      "Сіль – 1 ч. л.",
      "Чорний мелений перець – за смаком",
      "Олія для смаження",
    ],
  },
  {
    image: "exclusively-food2.jpg",
    title: "Котлети з булгуром та шпинатом у соусі",
    price: "100 грн",
    ingredients: [
      "Яловичо‑свинячий фарш – 500 г",
      "Яйце – 1 шт.",
      "Булгур – 160 г",
      "Морква – 3 шт.",
      "Шпинат заморожений – 5 таблеток",
      "Сіль – 1,5 ч. л.",
      "Чорний мелений перець – 1/3 ч. л.",
      "Крохмаль – 2 ст. л.",
      "Олія для смаження",
      "Соус:",
      "Кетчуп – 250 мл",
      "Зелень – 30 г",
      "Сіль – 1 ч. л.",
      "Чорний мелений перець – 1/3 ч. л.",
      "Вода – 300 мл",
    ],
  },
  {
    image: "exclusiveІу-food3.jpg",
    title: "Домашні сосиски з сиром",
    price: "100 грн",
    ingredients: [
      "Куряче філе – 500 г",
      "Яйце – 1 шт.",
      "Цибуля – 1 шт.",
      "Часник – за бажанням",
      "Сир – за смаком",
      "Сіль – за смаком",
      "Чорний мелений перець – за смаком",
    ],
  },
  {
    image: "exclusiveІу-food4.jpg",
    title: "Вареники з картоплею",
    price: "100 грн",
    ingredients: [
      "Тісто:",
      "Борошно – 400 г",
      "Тепла вода – 250 мл",
      "Яйце – 1 шт.",
      "Сіль – 1 ч. л.",
      "Олія – 1 ст. л.",
      "Начинка:",
      "Картопля – 500 г",
      "Цибуля – 1 велика",
      "Вершкове масло – 50 г",
      "Сіль – за смаком",
      "Чорний мелений перець – за смаком",
    ],
  },
];

function App() {
  const [menuOpen, setMenuOpen] = useState(false);

  return (
    <BrowserRouter>
      <Routes>

        {/* ✅ Главная страница */}
        <Route
          path="/"
          element={
            <>
              <Header />
              <FirstSection />
              <FoodContainer foods={foods} />
              <SecondSection />
              <FoodContainer foods={extraFoods} />
              <ExclusiveSection />
              <FoodContainer foods={ExclusiveFoods} />
            </>
          }
        />

        {/* ✅ Страница регистрации */}
        <Route path="/register" element={<Register />} />

      </Routes>
    </BrowserRouter>
  );
}

export default App;
